Dygmalab/Kaleidoscope-Bundle-Dygma/boards.txt
# Copyright (c) 2019, 2020  DygmaLab, SE.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Raise (Bootloader)
# ---------------------------------------
raise_edbg.name=Dygma Raise (Bootloader)
raise_edbg.vid.0=0x03eb
raise_edbg.pid.0=0x2157

raise_edbg.upload.tool=openocd
raise_edbg.upload.protocol=sam-ba
raise_edbg.upload.maximum_size=262144
raise_edbg.upload.use_1200bps_touch=false
raise_edbg.upload.wait_for_upload_port=false
raise_edbg.upload.native_usb=false
raise_edbg.build.mcu=cortex-m0plus
raise_edbg.build.f_cpu=48000000L
raise_edbg.build.usb_product="Raise Bootloader"
raise_edbg.build.usb_manufacturer="Dygma"
raise_edbg.build.board=SAMD_RAISE
raise_edbg.build.core=arduino
raise_edbg.build.extra_flags=-g3  -D__SAMD21G18A__ {build.usb_flags} -DKALEIDOSCOPE_HARDWARE_H="Kaleidoscope-Hardware-Dygma-Raise.h"
raise_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
raise_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
raise_edbg.build.variant=arduino_zero
raise_edbg.build.variant_system_lib=
#raise_edbg.build.vid=0x2341
#raise_edbg.build.pid=0x804d
raise_edbg.build.vid=0x1209
raise_edbg.build.pid=0x2202
raise_edbg.bootloader.tool=openocd
raise_edbg.bootloader.file=zero/samd21_sam_ba.bin

# Raise (Native USB Port)
# ---------------------------------------
raise_native.name=Dygma Raise
raise_native.vid.0=0x2341
raise_native.pid.0=0x804d
raise_native.vid.1=0x1209
raise_native.pid.1=0x2201

raise_native.vid.2=0x2341
raise_native.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
raise_native.vid.2.build.vid=0x2341
raise_native.vid.2.build.pid=0x824d
raise_native.vid.2.build.usb_product="Raise"
raise_native.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

raise_native.vid.3=0x2341
raise_native.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
raise_native.vid.3.build.vid=0x2341
raise_native.vid.3.build.pid=0x824d
raise_native.vid.3.build.usb_product="Raise"
raise_native.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

raise_native.upload.tool=bossac
raise_native.upload.protocol=sam-ba
raise_native.upload.maximum_size=262144
raise_native.upload.use_1200bps_touch=false
raise_native.upload.wait_for_upload_port=true
raise_native.upload.native_usb=true
raise_native.build.mcu=cortex-m0plus
raise_native.build.f_cpu=48000000L
raise_native.build.usb_product="Raise"
raise_native.build.usb_manufacturer="Dygma"
raise_native.build.board=SAMD_RAISE
raise_native.build.core=arduino
raise_native.build.extra_flags=-g3 -D__SAMD21G18A__ {build.usb_flags} -DKALEIDOSCOPE_HARDWARE_H="Kaleidoscope-Hardware-Dygma-Raise.h" -DEEPROM_EMULATION_SIZE=8192 -DUSB_DEVICE_LPM_SUPPORT=1 {build.version_flags}
raise_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
raise_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
raise_native.build.variant=arduino_zero
raise_native.build.variant_system_lib=
raise_native.build.vid=0x1209
raise_native.build.pid=0x2201
raise_native.bootloader.tool=openocd
raise_native.bootloader.file=zero/samd21_sam_ba.bin
